from discord.ext import commands  # импортируем из фреймворка класс commands.
import discord  # импортируем библиотеку discord.
from func import *
import os

bot = commands.Bot(command_prefix='.', intents=discord.Intents.all())

bot.remove_command('help')  # удаляет команду help ранее зарегистрированное когами.


@bot.event
async def on_ready():
    print('{0.user} запущен!'.format(bot))


async def open_acc(user):
    users = await get_bank()
    if user.bot is True:
        return
    if str(user.id) in users:
        return False
    else:
        users[str(user.id)] = {}
        users[str(user.id)]['wallet'] = 100
    write_json('jsons/bank.json', users)
    return True


async def get_bank():
    users = load_json('jsons/bank.json')
    return users


for filename in os.listdir("./cogs"):
    if filename.endswith(".py") and not filename.startswith("_"):
        bot.load_extension(f'cogs.{filename[:-3]}')

bot.run('OTg4ODM0Nzk5NjU1NDUyNzAz.GoPoso.Dgd445Dg2soOs5YWUj9zErO5xc_cWwnqJj4K2U')

# ----------------------------------------------------------------------------------------------------------------------#

# ОБНОВИТЬ!
# 1 строка: импортируем библиотеку discord.
# 2 строка: импортируем из фреймворка класс commands.
# 3 строка: импортируем библиотеку os.

# 5 строка: провозглашаем переменную для бота с префиксом '.' и включаем намерения.

# 8 строка: bot.event обозначает программе, что следующая функция будет реакцией на действие.
# 9 строка: функцию on_ready вызывает фреймворк, если бот аутентифицировался.
# 10 строка: даёт знать о том, что бот запустился.

# 13-17 строка: загрузка cogs.
# 13 строка: bot.command обозначает программе, что следующая функция будет командой.
# 14 строка: Команда для загрузки кога. В discord.py Cogs это класс, который позволяет группировать команды и делать
# к примеру раздельные модули, которые можно подгружать и наоборот, прямо во время работы бота.
# ctx - сама команда. extension - название файла кога.
# 15 строка: Название кога в нижнем регистре (маленькими буквами).
# 17 строка: загрузка кога.
# 17 строка: отправка сообщения в канал, где была написана команда.

# 20-24 строка: выгрузка cogs.

# 26 строка: когда бот будет включаться, он будет автоматически загружать все коги.
# ./ обозначает папку в которой мы сейчас находимся. Cogs означает, что надо найти папку cogs в каталоге.
# 27 строка: добавляем условие, благодаря которому мы будем использовать только файлы с расширением .py в виде когов.
# 28 строка: загружаем коги, которые удовлетворяют условию и срезаем .py, так как сы проверили это в условии.

# ----------------------------------------------------------------------------------------------------------------------#
